* Nonfood items
#+begin_src python :results output raw table
import pandas as pd

items = pd.read_excel('../Documentation/CIV-EHCVM1-QNR-MEN-EXCEL-VAGUE1.xlsx',
                      sheet_name='S9b__Conso_NA',
                      usecols=[0,1],
                      names = ['Code','Label'],
                      skiprows=11).dropna()

items = items.set_index('Code')
print(items.to_markdown())

items.to_json('nonfood_items.json')
#+end_src

#+results:
| Code | Label                                       |
|------+---------------------------------------------|
|  201 | Cigarettes, Tabac                           |
|  202 | Pétrole lampant                             |
|  203 | Charbon de bois/Charbon minéral             |
|  204 | Bois de chauffe acheté                      |
|  205 | Bois de chauffe ramassé (estimer la valeur) |
|  206 | Bougies                                     |
|  207 | Allumettes                                  |
|  208 | Carburant pour véhicule                     |
|  209 | Carburant pour motocyclette                 |
|  210 | Transport urbain en taxi                    |
|  211 | Transport urbain en bus                     |
|  212 | Transport urbain/rural en moto-taxi         |
|  213 | Transport urbain en train                   |
|  214 | Transport urbain/rural par voie fluviale    |
|  215 | Transport urbain/rural par traction animale |
|  216 | Journaux                                    |
|  217 | Frais de mouture des céréales               |


